results/res/disagg_480p_h200_h200_32b_image20/test_sglang_multi_rates_480p_20260514_195302/rate_1.0/results.txt
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=20, image_resolution='640x480', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_h200_z_disagg_32b_image20/test_sglang_multi_rates_480p_20260514_195302/rate_1.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:7001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=256, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=20, image_resolution='640x480', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_h200_z_disagg_32b_image20/test_sglang_multi_rates_480p_20260514_195302/rate_1.0/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 1565459
#Output tokens: 31391
#Total images: 5120
#Images per request: 20 (fixed)

Created 256 random jpeg images with average 6197473 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 256/256 [05:43<00:00,  1.34s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     234       
Benchmark duration (s):                  343.79    
Total input tokens:                      1431065   
Total input text tokens:                 17705     
Total input vision tokens:               1413360   
Total generated tokens:                  28253     
Total generated tokens (retokenized):    28166     
Request throughput (req/s):              0.68      
Input token throughput (tok/s):          4162.65   
Output token throughput (tok/s):         82.18     
Peak output token throughput (tok/s):    1201.00   
Peak concurrent requests:                99        
Total token throughput (tok/s):          4244.83   
Concurrency:                             67.46     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   99107.31  
Median E2E Latency (ms):                 98132.62  
P90 E2E Latency (ms):                    145781.36 
P99 E2E Latency (ms):                    172534.46 
---------------Time to First Token----------------
Mean TTFT (ms):                          50570.09  
Median TTFT (ms):                        50257.46  
P99 TTFT (ms):                           99058.43  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          475.99    
Median TPOT (ms):                        435.72    
P99 TPOT (ms):                           1632.94   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           409.10    
Median ITL (ms):                         30.78     
P95 ITL (ms):                            1640.34   
P99 ITL (ms):                            2321.65   
Max ITL (ms):                            55051.97  
==================================================